PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dma.c
/*!
    \file    gd32f3x0_hal_dma.h
    \brief   DMA driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

#define _DEV_VALID_ADDRESS           ((uint32_t)0x68000000)

/*!
    \brief      initialize DMA channel
    \param[in]  dma_dev: DMA device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  channelx:specify which DMA channel is initialized.
                  the argument could be selected from enumeration <dma_channel_enum>
                  \arg        DMA_CHx(x=0..6)
    \param[in]  dma: the pointer of DMA init structure
                  direction: DMA_DIR_PERIPH_TO_MEMORY, DMA_DIR_MEMORY_TO_PERIPH, DMA_DIR_MEMORY_TO_MEMORY
                  priority: DMA_PRIORITY_LEVEL_LOW, DMA_PRIORITY_LEVEL_MEDIUM, DMA_PRIORITY_LEVEL_HIGH, \
                            DMA_PRIORITY_LEVEL_ULTRA_HIGH:
                  mode: DMA_NORMAL_MODE, DMA_CIRCULAR_MODE
                  periph_inc: ENABLE, DISABLE
                  memory_inc: ENABLE, DISABLE
                  periph_width: DMA_PERIPH_SIZE_8BITS,DMA_PERIPH_SIZE_16BITS,DMA_PERIPH_SIZE_32BITS
                  memory_width: DMA_MEMORY_SIZE_8BITS,DMA_MEMORY_SIZE_16BITS,DMA_MEMORY_SIZE_32BITS
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE,HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_init(hal_dma_dev_struct *dma_dev, dma_channel_enum channelx, \
                     hal_dma_init_struct *dma)
{
    uint32_t ctl;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == dma_dev) || (NULL == dma)) {
        HAL_DEBUGE("pointer [dma] or [dma_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check DMA mode and direction parameters */
    if((DMA_CIRCULAR_MODE == dma->mode) && (DMA_DIR_MEMORY_TO_MEMORY  \
        == dma->direction)) {
        HAL_DEBUGI("circular mode is invalid due to 'memory to memory' has been configured");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* change DMA device state */
    dma_dev->state = HAL_DMA_STATE_BUSY;

    dma_dev->channel = channelx;
    /* disable dma channelx */
    hals_dma_channel_disable(dma_dev->channel);

    /* configure peripheral transfer width,memory transfer width,channel priority */
    ctl = DMA_CHCTL(channelx);
    ctl &= ~(DMA_CHXCTL_PWIDTH | DMA_CHXCTL_MWIDTH | DMA_CHXCTL_PRIO | \
             DMA_CHXCTL_M2M | DMA_CHXCTL_DIR | DMA_CHXCTL_CMEN);
    ctl |= (dma->periph_width | dma->memory_width | dma->priority | \
            dma->direction | dma->mode);
    DMA_CHCTL(channelx) = ctl;
    /* configure peripheral increasing mode */
    if(ENABLE == dma->periph_inc) {
        DMA_CHCTL(channelx) |= DMA_CHXCTL_PNAGA;
    } else {
        DMA_CHCTL(channelx) &= ~DMA_CHXCTL_PNAGA;
    }

    /* configure memory increasing mode */
    if(ENABLE == dma->memory_inc) {
        DMA_CHCTL(channelx) |= DMA_CHXCTL_MNAGA;
    } else {
        DMA_CHCTL(channelx) &= ~DMA_CHXCTL_MNAGA;
    }
    /* change DMA device state */
    dma_dev->state = HAL_DMA_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the DMA structure with the default values
    \param[in]  struct_type: the argument could be selected from enumeration <hal_dma_struct_type_enum>
    \param[in]  p_struct: pointer to DMA structure that contains the configuration information
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE,HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_struct_init(hal_dma_struct_type_enum struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(struct_type) {
    case HAL_DMA_INIT_STRUCT:
        /* initialize DMA initialization structure with the default values */
        ((hal_dma_init_struct *)p_struct)->direction = DMA_DIR_PERIPH_TO_MEMORY;
        ((hal_dma_init_struct *)p_struct)->priority = DMA_PRIORITY_LEVEL_LOW;
        ((hal_dma_init_struct *)p_struct)->mode = DMA_NORMAL_MODE;
        ((hal_dma_init_struct *)p_struct)->periph_inc = DISABLE;
        ((hal_dma_init_struct *)p_struct)->memory_inc = ENABLE;
        ((hal_dma_init_struct *)p_struct)->periph_width = DMA_PERIPH_SIZE_8BITS;
        ((hal_dma_init_struct *)p_struct)->memory_width = DMA_MEMORY_SIZE_8BITS;

        break;

    case HAL_DMA_DEV_STRUCT:
        /* initialize DMA device information structure with the default values */
        ((hal_dma_dev_struct *)p_struct)->channel = DMA_CH0;
        ((hal_dma_dev_struct *)p_struct)->dma_irq.error_handle = NULL;
        ((hal_dma_dev_struct *)p_struct)->dma_irq.half_finish_handle = NULL;
        ((hal_dma_dev_struct *)p_struct)->dma_irq.full_finish_handle = NULL;
        ((hal_dma_dev_struct *)p_struct)->error_state = HAL_DMA_ERROR_NONE;
        ((hal_dma_dev_struct *)p_struct)->state = HAL_DMA_STATE_NONE;
        ((hal_dma_dev_struct *)p_struct)->p_periph = NULL;
        ((hal_dma_dev_struct *)p_struct)->mutex = HAL_MUTEX_UNLOCKED;

        break;

    case HAL_DMA_IRQ_STRUCT:
        /* initialize DMA device interrupt callback function structure with the default values */
        ((hal_dma_irq_struct *)p_struct)->error_handle = NULL;
        ((hal_dma_irq_struct *)p_struct)->full_finish_handle = NULL;
        ((hal_dma_irq_struct *)p_struct)->half_finish_handle = NULL;

        break;
    default:
        HAL_DEBUGE("parameter [struct_type] value is invalid");
        return HAL_ERR_VAL;
    }

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      deinitialize DMA device structure and init structure
    \param[in]  dma_dev: DMA device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_deinit(hal_dma_dev_struct *dma_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == dma_dev) {
        HAL_DEBUGE("parameter [*dma_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* deinitialize DMA a channel registers */
    /* disable DMA a channel */
    DMA_CHCTL(dma_dev->channel) &= ~DMA_CHXCTL_CHEN;
    /* reset DMA channel registers */
    DMA_CHCTL(dma_dev->channel) = DMA_CHCTL_RESET_VALUE;
    DMA_CHCNT(dma_dev->channel) = DMA_CHCNT_RESET_VALUE;
    DMA_CHPADDR(dma_dev->channel) = DMA_CHPADDR_RESET_VALUE;
    DMA_CHMADDR(dma_dev->channel) = DMA_CHMADDR_RESET_VALUE;
    DMA_INTC |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, dma_dev->channel);
    /* reset DMA devices */
    hal_dma_struct_init(HAL_DMA_DEV_STRUCT, dma_dev);
    /* reset DMA device interrupt callback functions */
    dma_dev->dma_irq.error_handle = NULL;
    dma_dev->dma_irq.full_finish_handle = NULL;
    dma_dev->dma_irq.half_finish_handle = NULL;
    dma_dev->error_state = HAL_DMA_ERROR_NONE;
    dma_dev->state = HAL_DMA_STATE_RESET;
    dma_dev->p_periph = NULL;
    dma_dev->mutex = HAL_MUTEX_UNLOCKED;

