PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dma.c
    return HAL_ERR_NONE;
}

/*!
    \brief      start DMA transfering
    \param[in]  dma_dev: DMA device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  src_addr: the source memory buffer address
    \param[in]  dst_addr: the destination memory buffer address
    \param[in]  length: the number of data to be transferred from source to destination
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_BUSY, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_start(hal_dma_dev_struct *dma_dev, uint32_t src_addr, \
                      uint32_t dst_addr, uint16_t length)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check DMA pointer address */
    if(NULL == dma_dev) {
        HAL_DEBUGE("pointer [dma_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(0 == (src_addr & _DEV_VALID_ADDRESS)) {
        HAL_DEBUGE("parameter [src_addr] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    if(0 == (dst_addr & _DEV_VALID_ADDRESS)) {
        HAL_DEBUGE("parameter [dst_addr] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock DMA */
    HAL_LOCK(dma_dev);
    if(HAL_DMA_STATE_READY == dma_dev->state) {

        dma_dev->state = HAL_DMA_STATE_BUSY ;
        dma_dev->error_state =  HAL_DMA_ERROR_NONE;
        /* disable DMA channel */
        hals_dma_channel_disable(dma_dev->channel);

        if(RESET != (DMA_CHCTL(dma_dev->channel) & DMA_CHXCTL_DIR)) {
            /* configure the transfer destination and source address */
            hals_dma_memory_address_config(dma_dev->channel, src_addr);
            hals_dma_periph_address_config(dma_dev->channel, dst_addr);
        } else {
            /* configure the transfer destination and source address */
            hals_dma_memory_address_config(dma_dev->channel, dst_addr);
            hals_dma_periph_address_config(dma_dev->channel, src_addr);
        }
        /* configure the transfer number */
        hals_dma_transfer_number_config(dma_dev->channel, length);
        /* enable DMA channel */
        hals_dma_channel_enable(dma_dev->channel);
    } else {
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);
        
        return HAL_ERR_BUSY;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop DMA transfering
    \param[in]  dma_dev: DMA device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE,HAL_ERR_ALREADY_DONE details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_stop(hal_dma_dev_struct *dma_dev)
{   
#if (1 == HAL_PARAMETER_CHECK)
    /* check DMA pointer address */
    if(NULL == dma_dev) {
        HAL_DEBUGE("pointer [dma_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    if(HAL_DMA_STATE_BUSY != dma_dev->state) {
        /* dma not in transfer state */
        dma_dev->error_state = HAL_DMA_ERROR_NOTRANSFER;
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);

        return HAL_ERR_ALREADY_DONE;

    } else {

        /* disable DMA channel */
        hals_dma_channel_disable(dma_dev->channel);
        /* clear all flags */
        hals_dma_flag_clear(dma_dev->channel, DMA_INTF_GIF);

    }
    dma_dev->state = HAL_DMA_STATE_READY ;
    /* unlock DMA */
    HAL_UNLOCK(dma_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      DMA interrupt handler content function,which is merely used in dma_handler
    \param[in]  dma_dev: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_irq(hal_dma_dev_struct *dma_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the DMA pointer address and the number length parameter */
    if(NULL == dma_dev) {
        HAL_DEBUGE("parameter [dma_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* full transfer finish interrupt handler */
    if(SET == hals_dma_interrupt_flag_get(dma_dev->channel, DMA_INTF_FTFIF)) {
        hals_dma_interrupt_flag_clear(dma_dev->channel, DMA_INTF_FTFIF);
        if(dma_dev->dma_irq.full_finish_handle != NULL) {
            dma_dev->dma_irq.full_finish_handle(dma_dev);
            /* unlock DMA */
            dma_dev->state = HAL_DMA_STATE_READY;
            HAL_UNLOCK(dma_dev);
        }
    }

    /* half transfer finish interrupt handler */
    if(SET == hals_dma_interrupt_flag_get(dma_dev->channel, DMA_INTF_HTFIF)) {
        /* if DMA not in circular mode */
        if(0 == (DMA_CHCTL(dma_dev->channel) & DMA_CHXCTL_CMEN)) {
            hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_HTF);
                    }
        hals_dma_interrupt_flag_clear(dma_dev->channel, DMA_INTF_HTFIF);
        if(dma_dev->dma_irq.half_finish_handle != NULL) {
            dma_dev->dma_irq.half_finish_handle(dma_dev);
        }


    }

    /* error interrupt handler */
    if(SET == hals_dma_interrupt_flag_get(dma_dev->channel, DMA_INTF_ERRIF)) {
        hals_dma_interrupt_flag_clear(dma_dev->channel, DMA_INTF_GIF);
        dma_dev->state = HAL_DMA_STATE_READY;
        dma_dev->error_state = HAL_DMA_ERROR_TRANSFER;
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);
        if(dma_dev->dma_irq.error_handle != NULL) {
            dma_dev->dma_irq.error_handle(dma_dev);
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to DMA interrupt callback function pointer structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_irq_handle_set(hal_dma_dev_struct *dma_dev, hal_dma_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the DMA pointer address and the number length parameter */
    if(NULL == dma_dev) {
        HAL_DEBUGE("parameter [dma_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock DMA */
    HAL_LOCK(dma_dev);
    /* disable DMA channel */
    hals_dma_channel_disable(dma_dev->channel);
    /* set the handler pointer  */
    if(NULL != p_irq) {
        dma_dev->dma_irq.error_handle = p_irq->error_handle;
        dma_dev->dma_irq.full_finish_handle = p_irq->full_finish_handle;
        dma_dev->dma_irq.half_finish_handle = p_irq->half_finish_handle;
    }

