PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dma.c
    /* enable the channel error interrupt */
    if(NULL != dma_dev->dma_irq.error_handle) {
        hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_ERR);
    } else {
        hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_ERR);
        HAL_DEBUGE("parameter [error_handle] value is invalid");
    }

    /* set the full finish handler pointer and enable the channel full transfer finish  interrupt */
    if(NULL != dma_dev->dma_irq.full_finish_handle) {
        hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_FTF);
    } else {
        hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_FTF);
        HAL_DEBUGE("parameter [full_finish_handle] value is invalid");
    }

    /* set the half finish handler pointer and enable the channel half transfer finish interrupt */
    if(NULL != dma_dev->dma_irq.half_finish_handle) {
        hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_HTF);
    } else {
        hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_HTF);
        HAL_DEBUGE("parameter [half_finish_handle] value is invalid");
    }
    /* enable DMA channel */
    hals_dma_channel_enable(dma_dev->channel);
    /* unlock DMA */
    HAL_UNLOCK(dma_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_irq_handle_all_reset(hal_dma_dev_struct *dma_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the DMA pointer address and the number length parameter */
    if(NULL == dma_dev) {
        HAL_DEBUGE("parameter [dma_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock DMA */
    HAL_LOCK(dma_dev);
    /* DMA interrupt handler reset */
    dma_dev->dma_irq.error_handle = NULL;
    dma_dev->dma_irq.half_finish_handle = NULL;
    dma_dev->dma_irq.full_finish_handle = NULL;
    /* unlock DMA */
    HAL_UNLOCK(dma_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      start transfering amounts of data, poll transmit process and completed status
    \param[in]  dma_dev: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  transfer_state: refer to hal_dma_transfer_state_enum
    \param[in]  timeout_ms: time out duration
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, HAL_ERR_NONE, HAL_ERR_NO_SUPPORT,  \
                HAL_ERR_ALREADY_DONE, HAL_ERR_TIMEOUT  details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_start_poll(hal_dma_dev_struct *dma_dev, hal_dma_transfer_state_enum \
                           transfer_state, uint32_t timeout_ms)
{
    uint32_t flag, tick_start = 0;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dma_dev) {
        HAL_DEBUGE("parameter [dma_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the cirulation mode of the data transfer */
    if(RESET != (DMA_CHCTL(dma_dev->channel) & DMA_CHXCTL_CMEN)) {
        /* polling mode is not supported in circular mode */
        HAL_DEBUGE("DMA poll function is invalid in circulation mode");
        
        return HAL_ERR_NO_SUPPORT;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_DMA_STATE_BUSY != dma_dev->state) {
        /* no transfer */
        dma_dev->error_state = HAL_DMA_ERROR_NOTRANSFER;
        HAL_UNLOCK(dma_dev);

        return HAL_ERR_ALREADY_DONE;
    }
    /* get the transfer flag */
    if(HAL_DMA_TARNSFER_HALF == transfer_state) {
        flag = DMA_FLAG_ADD(DMA_INTF_HTFIF, dma_dev->channel);
    } else {
        flag = DMA_FLAG_ADD(DMA_INTF_FTFIF, dma_dev->channel);
    }

    /* set timeout */
    tick_start = hal_sys_basetick_count_get();

    while(RESET == (DMA_INTF & flag)) {
        if(SET == hals_dma_flag_get(dma_dev->channel, DMA_INTF_ERRIF)) {
            /* when error occurs, clear all flags and output error message */
            dma_dev->error_state = HAL_DMA_ERROR_TRANSFER;
            dma_dev->state = HAL_DMA_STATE_READY;
            hals_dma_flag_clear(dma_dev->channel, DMA_INTF_GIF);
            HAL_UNLOCK(dma_dev);
            HAL_DEBUGE("dma transfer error, poll stop");

            return HAL_ERR_HARDWARE;
        }
        /* check for the timeout */
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)){
            
                dma_dev->error_state = HAL_DMA_ERROR_TIMEOUT;
                dma_dev->state = HAL_DMA_STATE_TIMEOUT;
                /* when timeout occurs, output timeout warning message */
                HAL_DEBUGW("dma transfer state poll timeout");
                HAL_UNLOCK(dma_dev);

                return HAL_ERR_TIMEOUT;
                
            }
        }
    }

    hals_dma_flag_clear(dma_dev->channel, DMA_INTF_GIF);

    if(HAL_DMA_TARNSFER_FULL == transfer_state) {
        dma_dev->state = HAL_DMA_STATE_READY;
    }
    /* unlock DMA */
    HAL_UNLOCK(dma_dev);

    return HAL_ERR_NONE;
}

/*!
    \brief      start transfering amounts of data by interrupt method,the function is non-blocking
    \param[in]  dma_dev: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  src_addr: the source memory buffer address
    \param[in]  dst_addr: the destination memory buffer address
    \param[in]  length: the number of data to be transferred from source to destination
    \param[in]  p_irq: device interrupt callback function structure
                  error_handle: channel error interrupt handler pointer
                  half_finish_handle: channel half transfer finish interrupt handler pointer
                  full_finish_handle: channel full transfer finish interrupt handler pointer
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_start_interrupt(hal_dma_dev_struct *dma_dev, uint32_t src_addr, \
                                uint32_t dst_addr, uint16_t length, \
                                hal_dma_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the DMA pointer address and the number length parameter */
    if((NULL == dma_dev) || (0 == length)) {
        HAL_DEBUGE("parameter [dma_dev] and [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check src_addr parameter */
    if(0 == (src_addr & _DEV_VALID_ADDRESS)) {
        HAL_DEBUGE("parameter [src_addr] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check dst_addr parameter */
    if(0 == (dst_addr & _DEV_VALID_ADDRESS)) {
        HAL_DEBUGE("parameter [dst_addr] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* lock DMA */
    HAL_LOCK(dma_dev);

    if(HAL_DMA_STATE_READY == dma_dev->state) {

        dma_dev->state = HAL_DMA_STATE_BUSY;
        dma_dev->error_state = HAL_DMA_ERROR_NONE;
        /* set the handler pointer  */
        hals_dma_channel_disable(dma_dev->channel);
        /* set the handler pointer  */
        if(NULL != p_irq) {
            dma_dev->dma_irq.error_handle = p_irq->error_handle;
            dma_dev->dma_irq.full_finish_handle = p_irq->full_finish_handle;
            dma_dev->dma_irq.half_finish_handle = p_irq->half_finish_handle;
        }

