PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dma.c
        /* enable the channel error interrupt */
        if(NULL != dma_dev->dma_irq.error_handle) {
            hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_ERR);
        } else {
            hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_ERR);
            HAL_DEBUGE("parameter [error_handle] value is invalid");

        }

        /* set the full finish handler pointer and enable the channel full transfer finish  interrupt */
        if(NULL != dma_dev->dma_irq.full_finish_handle) {
            hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_FTF);
        } else {
            hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_FTF);
            HAL_DEBUGE("parameter [full_finish_handle] value is invalid");

        }

        /* set the half finish handler pointer and enable the channel half transfer finish interrupt */
        if(NULL != dma_dev->dma_irq.half_finish_handle) {
            hals_dma_interrupt_enable(dma_dev->channel, DMA_INT_HTF);
        } else {
            hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_HTF);
            HAL_DEBUGE("parameter [half_finish_handle] value is invalid");

        }

        /* clear all flags */
        hals_dma_flag_clear(dma_dev->channel, DMA_INTF_GIF);

        /* check the direction of the data transfer */
        if(RESET != (DMA_CHCTL(dma_dev->channel) & DMA_CHXCTL_DIR)) {
            /* configure the transfer destination and source address */
            hals_dma_memory_address_config(dma_dev->channel, src_addr);
            hals_dma_periph_address_config(dma_dev->channel, dst_addr);
        } else {
            /* configure the transfer destination and source address */
            hals_dma_memory_address_config(dma_dev->channel, dst_addr);
            hals_dma_periph_address_config(dma_dev->channel, src_addr);
        }
        /* configure the transfer number */
        hals_dma_transfer_number_config(dma_dev->channel, length);

        /* enable DMA channel */
        hals_dma_channel_enable(dma_dev->channel);
    } else {
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);
        return HAL_ERR_BUSY;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop transfering amounts of data by interrupt method,the function is non-blocking
    \param[in]  dma_dev: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE, HAL_ERR_ALREADY_DONE \
                details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_stop_interrupt(hal_dma_dev_struct *dma_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check DMA pointer address */
    if(NULL == dma_dev) {
        HAL_DEBUGE("pointer [dma_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_DMA_STATE_BUSY != dma_dev->state) {
        /* no transfer ongoing */
        dma_dev->error_state = HAL_DMA_ERROR_NOTRANSFER;
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);

        return HAL_ERR_ALREADY_DONE;
    } else {
        /* lock DMA */
        HAL_LOCK(dma_dev);
        /* disable DMA channel */
        hals_dma_channel_disable(dma_dev->channel);
        /* disable DMA IT */
        hals_dma_interrupt_disable(dma_dev->channel, DMA_INT_ERR | \
                                   DMA_INT_HTF | DMA_INT_FTF);
        dma_dev->state = HAL_DMA_STATE_READY;
        /* reset the interrupt handle */
        dma_dev->dma_irq.error_handle = NULL;
        dma_dev->dma_irq.full_finish_handle = NULL;
        dma_dev->dma_irq.half_finish_handle = NULL;
        /* clear all flags */
        hals_dma_flag_clear(dma_dev->channel, DMA_INTF_GIF);
        /* unlock DMA */
        HAL_UNLOCK(dma_dev);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable the DMA channels remapping
    \param[in]  dma_remap: specify the DMA channels to remap
                one or more parameters can be selected which are shown as below:
      \arg        DMA_REMAP_TIMER16_CH0_UP: remap TIMER16 channel0 and UP DMA requests to channel1(defaut channel0)
      \arg        DMA_REMAP_TIMER15_CH0_UP: remap TIMER15 channel2 and UP DMA requests to channel3(defaut channel2)
      \arg        DMA_REMAP_USART0_RX: remap USART0 Rx DMA request to channel4(default channel2)
      \arg        DMA_REMAP_USART0_TX: remap USART0 Tx DMA request to channel3(default channel1)
      \arg        DMA_REMAP_ADC: remap ADC DMA requests from channel0 to channel1
    \param[out] none
    \retval     int32_t: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_channel_remap_enable(uint32_t dma_remap){

    #if (1 == HAL_PARAMETER_CHECK)
        /* check syscfg_dma_remap parameter */
        if((DMA_REMAP_TIMER16_CH0_UP != dma_remap)  && \
        (DMA_REMAP_TIMER15_CH0_UP != dma_remap)  && \
        (DMA_REMAP_USART0_RX != dma_remap) && \
        (DMA_REMAP_USART0_TX != dma_remap) && \
        (DMA_REMAP_ADC != dma_remap)){
            HAL_DEBUGE("parameter [dma_remap] value is invalid");
            return HAL_ERR_VAL;
        }
    #endif /* 1 == HAL_PARAMETER_CHECK */

    SYSCFG_CFG0 |= dma_remap;

    return HAL_ERR_NONE;
}

/*!
    \brief      disable the DMA channels remapping
    \param[in]  dma_remap: specify the DMA channels to remap
                one or more parameters can be selected which are shown as below:
      \arg        DMA_REMAP_TIMER16_CH0_UP: remap TIMER16 channel0 and UP DMA requests to channel1(defaut channel0)
      \arg        DMA_REMAP_TIMER15_CH0_UP: remap TIMER15 channel2 and UP DMA requests to channel3(defaut channel2)
      \arg        DMA_REMAP_USART0_RX: remap USART0 Rx DMA request to channel4(default channel2)
      \arg        DMA_REMAP_USART0_TX: remap USART0 Tx DMA request to channel3(default channel1)
      \arg        DMA_REMAP_ADC: remap ADC DMA requests from channel0 to channel1
    \param[out] none
    \retval     int32_t: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dma_channel_remap_disable(uint32_t dma_remap){

